; domain
(define (domain logistics-strips)
  (:requirements :strips :constraints)
  (:predicates 	(OBJ ?obj)
	       	(TRUCK ?truck)
               	(LOCATION ?loc)
		(AIRPLANE ?airplane)
                (CITY ?city)
                (AIRPORT ?airport)
		(at ?obj ?loc)
		(in ?obj1 ?obj2)
		(in-city ?obj ?city))
 
  ; (:types )		; default object

(:action LOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
   (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action LOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
   (at ?obj ?loc) (at ?airplane ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?airplane)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
        (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action UNLOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
        (in ?obj ?airplane) (at ?airplane ?loc))
  :effect
   (and (not (in ?obj ?airplane)) (at ?obj ?loc)))

(:action DRIVE-TRUCK
  :parameters
   (?truck
    ?loc-from
    ?loc-to
    ?city)
  :precondition
   (and (TRUCK ?truck) (LOCATION ?loc-from) (LOCATION ?loc-to) (CITY ?city)
   (at ?truck ?loc-from)
   (in-city ?loc-from ?city)
   (in-city ?loc-to ?city))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action FLY-AIRPLANE
  :parameters
   (?airplane
    ?loc-from
    ?loc-to)
  :precondition
   (and (AIRPLANE ?airplane) (AIRPORT ?loc-from) (AIRPORT ?loc-to)
	(at ?airplane ?loc-from))
  :effect
   (and (not (at ?airplane ?loc-from)) (at ?airplane ?loc-to)))
)

; problem
(define (problem logistics-c5-s4-p3-a4)
(:domain logistics-strips)
(:objects a0 a1 a2 a3 
          c0 c1 c2 c3 c4 
          t0 t1 t2 t3 t4 
          l0-0 l0-1 l0-2 l0-3 l1-0 l1-1 l1-2 l1-3 l2-0 l2-1 l2-2 l2-3 l3-0 l3-1 l3-2 l3-3 l4-0 l4-1 l4-2 l4-3 
          p0 p1 p2 
)
(:init
    (AIRPLANE a0)
    (AIRPLANE a1)
    (AIRPLANE a2)
    (AIRPLANE a3)
    (CITY c0)
    (CITY c1)
    (CITY c2)
    (CITY c3)
    (CITY c4)
    (TRUCK t0)
    (TRUCK t1)
    (TRUCK t2)
    (TRUCK t3)
    (TRUCK t4)
    (LOCATION l0-0)
    (in-city  l0-0 c0)
    (LOCATION l0-1)
    (in-city  l0-1 c0)
    (LOCATION l0-2)
    (in-city  l0-2 c0)
    (LOCATION l0-3)
    (in-city  l0-3 c0)
    (LOCATION l1-0)
    (in-city  l1-0 c1)
    (LOCATION l1-1)
    (in-city  l1-1 c1)
    (LOCATION l1-2)
    (in-city  l1-2 c1)
    (LOCATION l1-3)
    (in-city  l1-3 c1)
    (LOCATION l2-0)
    (in-city  l2-0 c2)
    (LOCATION l2-1)
    (in-city  l2-1 c2)
    (LOCATION l2-2)
    (in-city  l2-2 c2)
    (LOCATION l2-3)
    (in-city  l2-3 c2)
    (LOCATION l3-0)
    (in-city  l3-0 c3)
    (LOCATION l3-1)
    (in-city  l3-1 c3)
    (LOCATION l3-2)
    (in-city  l3-2 c3)
    (LOCATION l3-3)
    (in-city  l3-3 c3)
    (LOCATION l4-0)
    (in-city  l4-0 c4)
    (LOCATION l4-1)
    (in-city  l4-1 c4)
    (LOCATION l4-2)
    (in-city  l4-2 c4)
    (LOCATION l4-3)
    (in-city  l4-3 c4)
    (AIRPORT l0-0)
    (AIRPORT l1-0)
    (AIRPORT l2-0)
    (AIRPORT l3-0)
    (AIRPORT l4-0)
    (OBJ p0)
    (OBJ p1)
    (OBJ p2)
    (at t0 l0-3)
    (at t1 l1-1)
    (at t2 l2-2)
    (at t3 l3-3)
    (at t4 l4-2)
    (at p0 l2-1)
    (at p1 l4-3)
    (at p2 l0-2)
    (at a0 l1-0)
    (at a1 l4-0)
    (at a2 l1-0)
    (at a3 l4-0)
)
(:goal
    (and
        (at p0 l4-1)
        (at p1 l3-0)
        (at p2 l4-1)
    )
)

  (:constraints
    (always (not (at p0 l0-0)))
  )
)

; plan
1. (fly-airplane a0 l1-0 l4-0)
   deleted: (at a0 l1-0)
   added: (at a0 l4-0)
   goals met: 0 of 3
2. (drive-truck t4 l4-2 l4-3 c4)
   deleted: (at t4 l4-2)
   added: (at t4 l4-3)
   goals met: 0 of 3
3. (drive-truck t2 l2-2 l2-1 c2)
   deleted: (at t2 l2-2)
   added: (at t2 l2-1)
   goals met: 0 of 3
4. (drive-truck t0 l0-3 l0-2 c0)
   deleted: (at t0 l0-3)
   added: (at t0 l0-2)
   goals met: 0 of 3
5. (fly-airplane a1 l4-0 l0-0)
   deleted: (at a1 l4-0)
   added: (at a1 l0-0)
   goals met: 0 of 3
6. (fly-airplane a2 l1-0 l4-0)
   deleted: (at a2 l1-0)
   added: (at a2 l4-0)
   goals met: 0 of 3
7. (load-truck p1 t4 l4-3)
   deleted: (at p1 l4-3)
   added: (in p1 t4)
   goals met: 0 of 3
8. (load-truck p0 t2 l2-1)
   deleted: (at p0 l2-1)
   added: (in p0 t2)
   goals met: 0 of 3
9. (load-truck p2 t0 l0-2)
   deleted: (at p2 l0-2)
   added: (in p2 t0)
   goals met: 0 of 3
10. (fly-airplane a0 l4-0 l2-0)
   deleted: (at a0 l4-0)
   added: (at a0 l2-0)
   goals met: 0 of 3
11. (drive-truck t4 l4-3 l4-1 c4)
   deleted: (at t4 l4-3)
   added: (at t4 l4-1)
   goals met: 0 of 3
12. (drive-truck t2 l2-1 l2-0 c2)
   deleted: (at t2 l2-1)
   added: (at t2 l2-0)
   goals met: 0 of 3
13. (drive-truck t0 l0-2 l0-0 c0)
   deleted: (at t0 l0-2)
   added: (at t0 l0-0)
   goals met: 0 of 3
14. (unload-truck p0 t2 l2-0)
   deleted: (in p0 t2)
   added: (at p0 l2-0)
   goals met: 0 of 3
15. (unload-truck p2 t0 l0-0)
   deleted: (in p2 t0)
   added: (at p2 l0-0)
   goals met: 0 of 3
16. (drive-truck t4 l4-1 l4-0 c4)
   deleted: (at t4 l4-1)
   added: (at t4 l4-0)
   goals met: 0 of 3
17. (load-airplane p0 a0 l2-0)
   deleted: (at p0 l2-0)
   added: (in p0 a0)
   goals met: 0 of 3
18. (load-airplane p2 a1 l0-0)
   deleted: (at p2 l0-0)
   added: (in p2 a1)
   goals met: 0 of 3
19. (unload-truck p1 t4 l4-0)
   deleted: (in p1 t4)
   added: (at p1 l4-0)
   goals met: 0 of 3
20. (fly-airplane a0 l2-0 l4-0)
   deleted: (at a0 l2-0)
   added: (at a0 l4-0)
   goals met: 0 of 3
21. (fly-airplane a1 l0-0 l4-0)
   deleted: (at a1 l0-0)
   added: (at a1 l4-0)
   goals met: 0 of 3
22. (load-airplane p1 a2 l4-0)
   deleted: (at p1 l4-0)
   added: (in p1 a2)
   goals met: 0 of 3
23. (unload-airplane p0 a0 l4-0)
   deleted: (in p0 a0)
   added: (at p0 l4-0)
   goals met: 0 of 3
24. (unload-airplane p2 a1 l4-0)
   deleted: (in p2 a1)
   added: (at p2 l4-0)
   goals met: 0 of 3
25. (fly-airplane a2 l4-0 l3-0)
   deleted: (at a2 l4-0)
   added: (at a2 l3-0)
   goals met: 0 of 3
26. (unload-airplane p1 a2 l3-0)
   deleted: (in p1 a2)
   added: (at p1 l3-0)
   goals met: 1 of 3
27. (load-truck p2 t4 l4-0)
   deleted: (at p2 l4-0)
   added: (in p2 t4)
   goals met: 1 of 3
28. (load-truck p0 t4 l4-0)
   deleted: (at p0 l4-0)
   added: (in p0 t4)
   goals met: 1 of 3
29. (drive-truck t4 l4-0 l4-1 c4)
   deleted: (at t4 l4-0)
   added: (at t4 l4-1)
   goals met: 1 of 3
30. (unload-truck p2 t4 l4-1)
   deleted: (in p2 t4)
   added: (at p2 l4-1)
   goals met: 2 of 3
31. (unload-truck p0 t4 l4-1)
   deleted: (in p0 t4)
   added: (at p0 l4-1)
   goals met: 3 of 3
